namespace Studying
{
    internal class HouseGenerator
    {
        private static readonly string[] cities = { "Москва", "Санкт-Петербург", "Новосибирск", "Екатеринбург", "Нижний Новгород", "Казань", "Самара", "Омск", "Челябинск", "Ростов-на-Дону", "Уфа", "Волгоград", "Пермь", "Красноярск", "Воронеж", "Саратов", "Краснодар", "Тольятти", "Ижевск", "Барнаул", "Ульяновск", "Тюмень", "Иркутск", "Йошкар-Ола", "Ярославль", "Калининград", "Севастополь", "Симферополь", "Владивосток", "Мурманск", "Архангельск", "Петропавловск-Камчатский", "Вологда", "Кострома", "Хабаровск", "Чита", "Благовещенск", "Курган", "Братск", "Ханты-Мансийск", "Ноябрьск", "Магадан", "Анадырь", "Южно-Сахалинск", "Нальчик", "Владикавказ", "Грозный", "Махачкала", "Улан-Удэ", "Томск", "Горно-Алтайск", "Бийск", "Сочи", "Астрахань", "Киров", "Тверь", "Смоленск", "Якутск", "Тобольск", "Петрозаводск", "Кемерово", "Новокузнецк", "Оренбург", "Нижневартовск", "Сыктывкар", "Ямало-Ненецкий АО", "Курск", "Белгород", "Липецк", "Воркута", "Салехард", "Надым", "Новый Уренгой", "Тикси" };
        private static readonly string[] streets = { "Ленина", "Кирова", "Гагарина", "Пушкина", "Советская", "Мира", "Профсоюзов", "Красная", "Садовая", "Набережная", "Школьная", "Строителей", "Береговая", "Юбилейная", "Парковая", "Центральная", "Зеленая", "Октябрьская", "Мичурина", "Молодежная", "Орджоникидзе", "Рабочая", "Горького", "Солнечная", "Новая", "Лермонтова", "Тургенева", "Чехова", "Гоголя", "Достоевского", "Толстого", "Пастернака", "Маяковского", "Есенина", "Пушкинская", "Городская", "Лесная", "Северная", "Южная", "Западная", "Восточная", "Большая", "Малая", "Петровская", "Менделеева", "Суворова", "Кутузова", "Космонавтов", "Авиаторов", "Маршала Жукова", "Николаева", "Красноармейская", "Щорса", "Жуковского", "Мичуринская", "Карла Маркса", "Химиков", "Магистральная", "Дачная", "Спортивная", "Фрунзе", "Калинина", "Тверская", "Больничная", "Пионерская", "Герцена", "Чапаева", "Чкалова", "Куйбышева", "Ломоносова", "Цветочная", "Кедровая", "Железнодорожная", "Луговая", "Речная", "Полевая", "Садовый переулок", "Никитина", "Павловская", "Серова", "Стрелковая", "Березовая" };
        private static readonly string[] buildingTypes = { "Многоквартирный жилой дом", "Частный жилой дом", "Административное здание", "Банк", "Магазин", "Кафе", "Ресторан", "Отель", "Гостиница", "Кинотеатр", "Театр", "Больница", "Школа", "Университет", "Спортзал", "Бассейн", "Сауна", "Парикмахерская", "Кабинет стоматолога", "Ателье", "Аптека", "Книжный магазин", "Цветочный магазин", "Пекарня", "Кондитерская", "Суши-бар", "Пиццерия", "Бильярдная", "Солярий", "Строительная компания", "Агентство недвижимости", "Прокат автомобилей", "Автомойка", "Химчистка", "Магазин бытовой техники", "Магазин электроники", "Магазин спортивных товаров", "Салон красоты", "Музей", "Галерея искусств", "Выставочный зал", "Танцевальная студия", "Музыкальная школа", "Студия фотографии", "Рекламное агентство", "Компьютерный клуб", "Студия дизайна", "Туристическое агентство", "Страховая компания", "Баня", "Кладбище", "Рынок", "Кинотеатр IMAX", "Библиотека", "Торговый центр", "Автосервис", "Автомагазин", "Строительный магазин", "Магазин канцелярских товаров", "Магазин продуктов питания", "Магазин одежды", "Магазин обуви", "Магазин бытовой химии", "Ресторан быстрого питания", "Столовая", "Фастфуд", "Мебельный магазин", "Антикварный магазин", "Магазин цветов и подарков" };
        
        public static House Generate()
        {
            Random random = new();

            string city = cities[random.Next(cities.Length)];
            string street = streets[random.Next(streets.Length)];
            string buildingType = buildingTypes[random.Next(buildingTypes.Length)];
            ushort number = (ushort)random.Next(1, 100);
            ushort yearBuilt = (ushort)random.Next(1900, 2023);
            ushort numberOfFloors = (ushort)random.Next(1, 10);
            ushort numberOfApartments = (ushort)random.Next(1, 100);

            return new House(city, street, buildingType, number, yearBuilt, numberOfFloors, numberOfApartments);
        }
    }
}
