using System.ComponentModel;

namespace Studying;

public class HouseData
{
    public static readonly BindingList<House> houses = new()
    {
        new House("Москва", "Тверская", "квартирный", 10, 1980, 9, 50),
        new House("Санкт-Петербург", "Невский", "офисный", 25, 2005, 7, 30),
        new House("Казань", "Кремлевская", "жилой", 5, 1975, 5, 20),
        new House("Екатеринбург", "Ленина", "коттеджный", 15, 2010, 2, 10),
        new House("Новосибирск", "Кирова", "квартирный", 20, 1995, 12, 70),
        new House("Ростов-на-Дону", "Буденновский", "офисный", 12, 2000, 6, 40),
        new House("Красноярск", "Мира", "жилой", 30, 1985, 4, 15),
        new House("Уфа", "Ленинградская", "коттеджный", 8, 2015, 3, 5),
        new House("Самара", "Куйбышева", "квартирный", 18, 2005, 10, 60),
        new House("Волгоград", "Советская", "офисный", 22, 1990, 8, 35),
        new House("Омск", "Ленинская", "жилой", 7, 1970, 6, 25),
        new House("Челябинск", "Комсомольская", "коттеджный", 13, 2008, 2, 8),
        new House("Краснодар", "Гагарина", "квартирный", 24, 2000, 11, 55),
        new House("Тюмень", "Пермякова", "офисный", 17, 2010, 5, 45),
        new House("Иркутск", "Карла Маркса", "жилой", 9, 1988, 7, 30)
    };

    public static readonly HouseAdapter houseAdapter = new();
}
